Tekla.Structures.ModelInternal.PropertySet
Represents a Property Set data class.

Tekla.Structures.ModelInternal.PropertySet.EntityId
The PropertySetDefinition link to the external resource

Tekla.Structures.ModelInternal.PropertySet.Definition
The link to Property Set Definition.

Tekla.Structures.ModelInternal.PropertySet.Properties
The link to Property.

Tekla.Structures.ModelInternal.PropertySet.Version
The PropertySet version

Tekla.Structures.ModelInternal.PropertySet.SchemaVersion
The PropertySet Schemaversion